angular.module('demo').factory('Constants', [function() {
  'use strict';

  return {
    checkRegs: {
      REG_FLOAT_NUM: /^\d+(\.\d+)?$/,
      REG_NAME: /^[a-zA-Z\d\u4e00-\u9fa5]+$/,
      REG_PWD: /^(((?=.*[A-Z])(?=.*[a-z])(?=.*\d))|((?=.*[A-Z])(?=.*[a-z])(?=.*[!！$#%@&*-]))|((?=.*[A-Z])(?=.*\d)(?=.*[!！$#%@&*-]))|((?=.*[a-z])(?=.*\d)(?=.*[!！$#%@&*-])))/,
      //用户验证
      REG_PERSON_PWD: /^(?!\d+$)(?![A-Z]+$)(?![a-z]+$)[A-Za-z\d]+$/,
      REG_PERSON_MOBILE: /^1[34578]\d{9}$/,
      REG_PERSON_EMAIL: /^([a-zA-Z0-9_\.\-\+])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$/
    },
    cardCities: {
      11: '北京',
      12: '天津',
      13: '河北',
      14: '山西',
      15: '内蒙古',
      21: '辽宁',
      22: '吉林',
      23: '黑龙江',
      31: '上海',
      32: '江苏',
      33: '浙江',
      34: '安徽',
      35: '福建',
      36: '江西',
      37: '山东',
      41: '河南',
      42: '湖北',
      43: '湖南',
      44: '广东',
      45: '广西',
      46: '海南',
      50: '重庆',
      51: '四川',
      52: '贵州',
      53: '云南',
      54: '西藏',
      61: '陕西',
      62: '甘肃',
      63: '青海',
      64: '宁夏',
      65: '新疆',
      71: '台湾',
      81: '香港',
      82: '澳门',
      91: '国外'
    }
  };
}]);
